Repository: marzent/IINACT
Catalog: OverlayPlugin.Core/Resources.*.resx
Languages: de_de, fr_fr, ko_kr, zh_cn

# ActwsShimEnabled
source: ACTWS compatibility shim enabled.
de_de: ACTWS Kompatibilität aktiviert.
fr_fr: Compatibilité ACTWS activé.
ko_kr: ACT 웹소켓 호환성을 활성화
zh_cn: ACTWS兼容性功能已启用。

# WSInvalidDataRecv
source: Invalid data received: {0}; {1}
de_de: Ungültige Daten empfangen: {0}; {1}
fr_fr: Données non valides reçues : {0}; {1}
ko_kr: 유효하지 않은 데이터를 받았습니다 : {0}; {1}
zh_cn: 收到无效数据：{0}; {1}

# OverlayApiSubscribed
source: {0}: Subscribed to {1}
de_de: {0}: Hat {1} abonniert
fr_fr: {0}: Souscription à {1}
ko_kr: {0}: 구독 {1}
zh_cn: {0}：已订阅{1}

# WSLoadingCert
source: WS: Loading SSL certificate {0}...
de_de: WS: SSL-Zertifikat {0} wird geladen ...
fr_fr: WS : Chargement du certificat SSL {0}...
ko_kr: WS: SSL 인증서 {0} 로드 중...
zh_cn: WS：正在加载SSL证书{0}...

# ListSortFailed
source: Failed to sort list by {0}: {1}
de_de: Liste konnte nicht nach {0} sortiert werden: {1}
fr_fr: Impossible de trier la liste par {0}: {1}
ko_kr: {0}을 기준으로 정렬 실패: {1}
zh_cn: 以{0}: {1}排序列表失败

# InitOverlayLocalFileIsMissing
source: InitializeOverlay: Local file {0} does not exist!
de_de: InitializeOverlay: Lokale Datei {0} existiert nicht!
fr_fr: InitializeOverlay: Le fichier local {0} n'existe pas !
ko_kr: 오버레이 초기화: 로컬 파일 {0}이 없습니다!
zh_cn: 初始化插件：本地文件{0}不存在！

# WSUnsubFail
source: Failed to process unsubscription: {0}
de_de: Abmeldung fehlgeschlagen: {0}
fr_fr: Impossible de procéder à la déinscription : {0}
ko_kr: 구독 취소를 처리하지 못했습니다 : {0}
zh_cn: 处理退订失败：{0}

# RegisterHotkeyError
source: Failed to register hotkey {0}, {1} in EnableHotKeys().
de_de: Fehler beim registrieren des Hotkeys {0}, {1} in EnableHotKeys().
fr_fr: Impossible d'enregistrer le raccourci {0},{1} dans EnableHotKeys().!
ko_kr: EnableHotKeys()에서 단축키 {0}, {1}(을/를) 등록하지 못했습니다.
zh_cn: 在EnableHotKeys()注册热键{0}, {1}失败。

# WSMessageSendFailed
source: Failed to send message: {0}
de_de: Nachricht konnte nicht gesendet werden: {0}
fr_fr: Impossible d'enoyer le message : {0}
ko_kr: 메시지를 보내지 못했습니다 : {0}
zh_cn: 发送信息失败：{0}

# NetworkParserInitException
source: Failed to setup network parser: {0}
de_de: Netzwerkparser konnte nicht eingerichtet werden: {0}
fr_fr: Echec de la configuration réseau du parser : {0}
ko_kr: 네트워크 파서를 설정하지 못했습니다 : {0}
zh_cn: 无法设置网络解析器：{0}

# OverlayBaseRegisterHotkeyError
source: Failed to register hotkey: {0}!
de_de: Hotkey konnte nicht registriert werden: {0}!
fr_fr: Impossible d'enregistrer le raccourci : {0}!
ko_kr: 단축키 등록을 실패했습니다. : {0}!
zh_cn: 注册热键：{0}失败！

# WSNewSubFail
source: Failed to process new subscription: {0}
de_de: Neues Abonnement konnte nicht verarbeitet werden: {0}
fr_fr: Impossible de procéder à une nouvelle souscription : {0}
ko_kr: 새 구독을 처리하지 못했습니다 : {0}
zh_cn: 处理新订阅失败：{0}

# WSIndexPage
source: <h1>It Works!</h1> <p> If any of these links are displayed with a &quot;Local:&quot; prefix and not clickable then that's because those overlays display local files and web browsers don't allow web sites to link to local files. </p> <p> You'll have to copy &amp; paste that link into your address bar. </p>
de_de: <h1>Es Funktioniert!</h1> <p> Wenn einer dieser Links mit dem Präfix &quot;Lokal:&quot; angezeigt wird und nicht angeklickt werden kann, liegt dies daran, dass in diesem Overlays lokale Dateien angezeigt werden und Webbrowser es Websiten nicht erlauben, Links zu lokalen Dateien zu erstellen. </p> <p> Kopiere den Link und füge ihn in der Adressleiste ein. </p>
fr_fr: <h1>Ca fonctionne !</h1> <p> Si l'un de ces liens est affich&eacute; avec un pr&eacute;fixe &quot;Local:&quot; et qu'il ne peut pas &ecirc;tre cliqu&eacute;, c'est que ces overlays affichent des fichiers locaux et que les navigateurs Web n'autorisent pas les sites Web &agrave; cr&eacute;er des liens vers des fichiers locaux. </p> <p> Vous devrez copier et coller ce lien dans votre barre d'adresse </p>
zh_cn: <h1>It Works!</h1> <p> 如果这些链接中有任何一个以&quot;Local:&quot;为前缀显示且不可点击，那是因为 这些悬浮窗显示本地文件，并且网页浏览器不允许网站链接到本地文件。 </p> <p> 您必须复制&amp;并粘贴到您的地址栏中。 </p>

# WSStartFailed
source: WS: Failed to start: {0}
de_de: WS: Start fehlgeschlagen: {0}
fr_fr: WS : Impossible de démarrer : {0}
ko_kr: WS: 시작하지 못했습니다. {0}
zh_cn: WS:启动失败：{0}

# InitOverlayUrlError
source: InitializeOverlay: URI parse error! Please reconfigure the URL. (Config.Url = {0}): {1}
de_de: InitializeOverlay: URI-Analysefehler! Bitte konfigurieren Sie die URL neu. (Config.Url = {0}): {1}
fr_fr: InitializeOverlay: erreur d'analyse URI ! Reconfigurez l'URL. (Config.Url = {0}): {1}
ko_kr: 오버레이 초기화: URL 파싱 오류! URL 경로를 다시 확인해 주십시오. (Config.Url = {0}): {1}
zh_cn: 初始化插件：路径解析错误！请重新设置悬浮窗路径(Config.Url = {0}): {1}

# WSShutdownError
source: WS: Failed to shutdown. {0}
de_de: WS: Herunterfahren fehlgeschlagen. {0}
fr_fr: WS : L'arrêt a échoué. {0}
ko_kr: WS: 종료하지 못했습니다. {0}
zh_cn: WS:关闭失败：{0}

# IncompatibleAddon
source: Detected incompatible addon {0}. Please update as soon as possible!!
de_de: Inkompatibles Addon {0} erkannt. Bitte so schnell wie möglich aktualisieren!!
fr_fr: Addon {0} incompatible. Mettez à jour dès que possible !
ko_kr: 호환되지 않는 애드온 {0}(을/를) 감지했습니다. 가능한 빨리 업데이트하세요!
zh_cn: 检测到不兼容的插件{0}。请尽快更新！！

# UnregisterHotkeyError
source: Failed to unregister hotkey {0} in DisableHotKeys().
de_de: Hotkey {0} konnte in DisableHotKeys() nicht abgemeldet werden.
fr_fr: Impossible de supprimer le raccourci {0} dans DisableHotKeys() !
ko_kr: DisableHotKeys()에서 단축키 {0}(을/를) 등록 취소하지 못했습니다.
zh_cn: 在DisableHotKeys()反注册热键{0}失败。

# PromptSelectOverlayType
source: Please select overlay type.
de_de: Bitte Overlay-Typ auswählen.
fr_fr: Sélectionnez un type d'overlay.
ko_kr: 오버레이 유형을 선택하세요.
zh_cn: 请选择悬浮窗类型。

# MapOverlayShortSpellTimer
source: SpellTimer
zh_cn: 技能冷却

# HotkeyActionToggleLock
source: Toggle lock
de_de: Sperren umschalten
fr_fr: Bloqué
ko_kr: 오버레이 잠금 ON/OFF
zh_cn: 切换悬浮窗 锁定

# MapOverlayShortMiniParse
source: MiniParse
zh_cn: 数据统计

# MapOverlayShortLabel
source: Label
zh_cn: 标签

# HotkeyActionToggleVisible
source: Toggle visible/hide
de_de: sichtbar/versteckt umschalten
fr_fr: Visible/Caché
ko_kr: 오버레이 표시 ON/OFF
zh_cn: 切换悬浮窗 显示/隐藏

# HotkeyActionToggleClickthrough
source: Toggle clickthrough
de_de: Durchklicken umschalten
fr_fr: Clic à travers
ko_kr: 클릭 무시 ON/OFF
zh_cn: 切换悬浮窗 鼠标穿透

# TabsESLabel
source: Event Source
de_de: Ereignisquelle
zh_cn: 事件源

# GeneralTab
source: General
de_de: Allgemein
fr_fr: Général
ko_kr: 일반
zh_cn: 通用

# MapOverlaySpellTimer
source: SpellTimerOverlay
ko_kr: SpellTimer 오버레이
zh_cn: 技能冷却悬浮窗

# ErrorOverlayNameEmpty
source: Name must not be empty or white space only.
de_de: Der Name darf nicht leer sein oder nur aus Leerzeichen bestehen
fr_fr: Le nom ne doit pas être vide ou composé seulement d'espaces
ko_kr: 이름을 입력하세요.
zh_cn: 名称不得为空或只有空格。

# ErrorOverlayNameNotUnique
source: Name should be unique.
de_de: Der Name sollte einzigartig sein.
fr_fr: Le nom doit être unique
ko_kr: 이미 있는 이름입니다. 다른 이름을 설정하세요.
zh_cn: 名称不得重复。

# MapOverlayMiniParse
source: MiniParseOverlay
ko_kr: MiniParse 오버레이
zh_cn: 数据统计悬浮窗

# MapOverlayLabel
source: LabelOverlay
ko_kr: Label 오버레이
zh_cn: 标签悬浮窗

# MapESMiniParse
source: MiniParseEventSource
ko_kr: 고급 설정
zh_cn: 设置

# DuplicateHandlerError
source: Duplicate handler for name {0}!
de_de: Doppelter Handler für Name {0}!
fr_fr: Handler en double pour le nom {0}!
ko_kr: 이름 {0}에 대한 중복 처리!
zh_cn: 名称{0}重复处理！

# WSNotConfidentLink
source: This link might not work if the overlay doesn't support ACTWebSocket.
de_de: Dieser Link funktioniert eventuel nicht wenn das Overlay ACTWebSocket nicht unterstützt.
fr_fr: Ce lien peut ne pas fonctionner si l'overlay ne supporte pas ACTWebSocket.
ko_kr: 오버레이가 ACTWebSocket을 지원하지 않는다면, 이 링크는 작동하지 않을 수도 있습니다.
zh_cn: 如果此悬浮窗不支持ACTWebSocket，则此链接可能不会生效。

# JsHandlerCallException
source: JS Handler call failed: {0}
de_de: JS-Handler-Aufruf fehlgeschlagen: {0}
fr_fr: Appel JS Handler échoué : {0}
ko_kr: JS 핸들러 호출 실패: {0}
zh_cn: JS处理程序调用失败: {0}

# OverlayApiMissingEventsFieldUnsub
source: Missing events field in unsubscribe call: {0}!
de_de: Fehlendes Ereignissefeld beim Abmelden: {0}!
fr_fr: Champs d'évènements manquants dans l'appel de déinscription : {0}!
ko_kr: 구독 취소 호출에서 누락된 이벤트 필드 : {0}!
zh_cn: 取消订阅呼叫缺少事件字段：{0}

# WSHandlerException
source: WS: Handler call failed: {0}
de_de: WS: Handler-Aufruf fehlgeschlagen: {0}
ko_kr: WS: Handler 호출 실패: {0}
zh_cn: WS：处理程序调用失败：{0}

# OverlayApiInvalidHandlerCall
source: Received invalid handler call: {0}
de_de: Ungültiger Handler-Aufruf empfangen: {0}
fr_fr: Appel d'un handler invalide reçu : {0}
ko_kr: 유효하지 않은 핸들러 호출을 수신했습니다 : {0}
zh_cn: 收到无效的处理程序调用：{0}

# OverlayApiMissingEventsField
source: Missing events field in subscribe call: {0}!
de_de: Fehlendes Ereignissefeld im Abonnementaufruf: {0}!
fr_fr: Champs d'évènements manquants dans l'appel de souscription : {0}!
ko_kr: 구독 호출에서 누락된 이벤트 필드 : {0}!
zh_cn: 订阅呼叫中缺少事件字段：{0}

# MissingHandlerError
source: Tried to call missing handler "{0}"!
de_de: Versucht, fehlenden Handler "{0}" aufzurufen!
fr_fr: Appel à un handler manquant "{0}"!
ko_kr: 존재하지 않는 핸들러 "{0}"(을/를) 호출하려고 했습니다!
zh_cn: 尝试调用不存在的处理程序"{0}"！

# FFXIVDataRepositoryException
source: Failed to retrieve the FFXIV DataRepository: {0}
de_de: FFXIV Daten-Repository konnte nicht abgerufen werden: {0}
fr_fr: Impossible de récupérer FFXIV DataRepository: {0}
ko_kr: FFXIV DataRepository을 검색하지 못했습니다 : {0}
zh_cn: FFXIV DataRepository检索失败：{0}

# MissingEventDispatchError
source: Tried to dispatch unregistered event type "{0}"!
de_de: Versucht, nicht registrierten Ereignistyp "{0}" zu versenden!
fr_fr: Envoi d'un type d'événement non enregistré "{0}"!
ko_kr: 등록되지 않은 이벤트 유형 "{0}"(을/를) 발송하려고 했습니다!
zh_cn: 试图发送未注册的事件类型"{0}"！

# MissingEventSubError
source: Got a subscription for missing event "{0}"!
de_de: Abonnement für fehlendes Ereignis "{0}"!
fr_fr: Souscription pour un évènement manquant "{0}"!
ko_kr: 누락된 이벤트 "{0}"에 대한 구독이 있습니다!
zh_cn: 缺少事件"{0}"的订阅！

# FFXIVDataSubscriptionException
source: Failed to retrieve the FFXIV DataSubscription: {0}
de_de: FFXIV Daten-Subscription konnte nicht abgerufen werden: {0}
fr_fr: Impossible de récupérer FFXIV DataSubscription: {0}
ko_kr: FFXIV DataSubscription을 검색하지 못했습니다 : {0}
zh_cn: FFXIV DataSubscription检索失败：{0}

# EventHandlerException
source: Failed to dispatch event {0} to {1}! {2}
de_de: Ereignis {0} konnte nicht an {1} gesendet werden! {2}
fr_fr: Impossible d'envoyer l'événement {0} à {1}! {2}
ko_kr: 이벤트 {0}을 (를) {1}에 발송하지 못했습니다! {2}
zh_cn: 无法将事件{0}发送到{1}！ {2}

# ErrorCouldNotLoadPresets
source: NewOverlayDialog: Failed to load presets: {0}
de_de: NewOverlayDialog: Fehler beim laden der Voreinstellungen: {0}
fr_fr: NewOverlayDialog: Impossible de charger les préréglages : {0}
zh_cn: 新悬浮窗对话框：加载预设悬浮窗失败：{0}

# PromptSelectPreset
source: Please select a preset.
de_de: Bitte wähle eineVoreinstellung aus.
fr_fr: Sélectionnez un preset.
ko_kr: 프리셋을 선택해주세요.
zh_cn: 请选择一个预设悬浮窗。

# OverlayPreviewName
source: Preview
de_de: Vorschau
fr_fr: Aperçu
ko_kr: 미리 보기
zh_cn: 预览

# CustomPresetLabel
source: Custom
de_de: Benutzerdefiniert
fr_fr: Personnalisé
ko_kr: 커스텀
zh_cn: 自订

# PresetUsesUnsupportedType
source: Preset {0} uses unsupported type {1}!
de_de: Voreinstellung {0} benutzt eine nicht unterstütze Art {1}!
fr_fr: Le preset {0} utilise un type non supporté {1} !
ko_kr: {0} 프리셋은 지원하지 않는 형식 {1}을 사용합니다!
zh_cn: 预设{0}使用不受支持的类型{1}！

# NetworkParserNoFfxiv
source: Could not find Machina or the FFXIV plugin. This is only an issue if you're using ACT with FFXIV.
de_de: Machina oder das FFXIV-Plugin konnten nicht gefunden werden. Dies ist nur dann ein Problem, wenn Sie ACT mit FFXIV verwenden.
fr_fr: Impossible de trouver le plugin FFXIV ou Machina. C'est seulement un problème si vous utilisez ACT avec FFXIV.
ko_kr: Machina 혹은 FFXIV 플러그인을 발견하지 못했습니다. 이 문제는 파이널 판타지 14와 함께 ACT를 사용하는 분들께만 문제가 되는 부분입니다.
zh_cn: 找不到Machina或FFXIV插件。仅当您将ACT与FFXIV一起使用时才是问题。

# EventConfigTab
source: Event Settings
de_de: Event Einstellungen
ko_kr: 이벤트 설정
zh_cn: 基本设置

# HotkeyActionToggleEnabled
source: Toggle enabled
de_de: Umschalten aktiviert
ko_kr: 토글 활성화
zh_cn: 切换悬浮窗 启用/关闭

# LogNotConnectedError
source: ERROR: Log not connected.
zh_cn: 错误：未连接到日志。
